Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: And here is an example of a custom type contributor that registers a custom `UserType` (e.g. mapping a Boolean to "Y"/"N"):
ja_jp: カスタム `UserType` (例: Boolean を "Y"/"N" にマッピングする) を登録する、カスタムタイプコントリビューターの例です。

source: And here is an example of the data payload being sent:
ja_jp: そして、これが送信されるデータペイロードの例です：

source: And here is the final version of the file included in the runtime JAR augmented with other information collected by the Quarkus Maven plugin:
ja_jp: 以下は、Quarkus Maven プラグインが収集した他の情報も追加された、ランタイム JAR に含まれるファイルの最終バージョンです。

source: And here's an example of how to start an LRA in one resource method and close it in a different resource method using the `end` element of the `LRA` annotation. It also shows how to configure the LRA to be automatically cancelled if the business method returns the particular HTTP status codes identified in the `cancelOn` and `cancelOnFamily` elements:
ja_jp: ここでは、 `LRA` アノテーションの `end` 要素を使用して、あるリソース・メソッドで LRA を開始し、別のリソース・メソッドで閉じる方法の例を示しています。また、ビジネスメソッドが `cancelOn` および `cancelOnFamily` 要素で特定される特定の HTTP ステータスコードを返した場合に、LRA が自動的にキャンセルされるように設定する方法も示しています。

source: And here's the catch: for all these cases, the runtime will walk the entire classpath (remember, it won't find anything), trying to locate the class or resource. In doing so, it may open a large number of JAR files and read from them, just to conclude that the class or resource doesn't exist.
ja_jp: ここに落とし穴があります。これらすべてのケースで、ランタイムはクラスパス全体を走査し (何も見つからないことを思い出してください)、クラスやリソースを特定しようとします。その際、クラスやリソースが存在しないという結論を出すためだけに、大量の JAR ファイルを開いて読み取る可能性があります。

source: And if Quarkus DI needs to access a private member it *has to use reflection*. That's why Quarkus users are encouraged __not to use private members__ in their beans. This involves injection fields, constructors and initializers, observer methods, producer methods and fields, disposers and interceptor methods.
ja_jp: また、Quarkus DI がプライベートメンバーにアクセスする必要がある場合は、**リフレクションを使用しなければなりません**。そのため、Quarkus ユーザーは、プライベートメンバーを Bean で _使用しないこと_ が推奨されています。これには、インジェクションフィールド、コンストラクターとイニシャライザー、observer メソッド、producer メソッドおよび producer フィールド、disposers メソッドおよび interceptor メソッドが含まれます。

source: And if Quarkus DI needs to access a private member it, *has to use reflection*. That's why Quarkus users are encouraged __not to use private members__ in their beans. This involves injection fields, constructors and initializers, observer methods, producer methods and fields, disposers, and interceptor methods.
ja_jp: また、Quarkus DI がプライベートメンバーにアクセスする必要がある場合、*リフレクションを使用する必要があります*。そのため、Quarkus ユーザーは、Bean で __プライベートメンバーを使用しないこと__ を推奨されています。これには、注入フィールド、コンストラクターとイニシャライザー、オブザーバーメソッド、プロデューサーメソッドとフィールド、ディスポーザー、およびインターセプターメソッドが含まれます。

source: And if some other user has modified the resource between your `GET` and your `PUT` you would get this answer back:
ja_jp: また、他のユーザーが GET と PUT の間のリソースを変更した場合は、次の回答が返されます。

source: And if you spot additional opportunities to improve our build process, don't hesitate to open an issue: we're always happy to hear new ideas.
ja_jp: もしビルドプロセスの改善にさらなる機会を見つけられた場合は、遠慮なく課題をオープンしてください。私たちは常に新しいアイデアを歓迎しています。

source: And if you wonder how you will deploy your Quarkus application to Google Cloud, we have a link:/guides/deploying-to-google-cloud[new guide] for you.
ja_jp: また、Quarkus アプリケーションをどのように Google Cloud にデプロイするのか疑問に思っている方のために、 https://quarkus.io/guides/deploying-to-google-cloud[新しいガイド]をご用意しました。

source: And if your existing compiled code calls `GHUser getMyself()`, it will still work after the change of return type.
ja_jp: また、既存のコンパイル済みコードが `GHUser getMyself()` を呼び出す場合、戻り値の型を変更した後も動作します。

source: And in the JAX-RS resource:
ja_jp: そして、JAX-RS リソースでは:

source: And in the Jakarta REST resource:
ja_jp: そして、Jakarta RESTのリソースは以下のようにします:

source: And in the provider implementation:
ja_jp: そして、プロバイダの実装では

source: And in the web resource we handle the `POST` request:
ja_jp: また、Web リソースでは、 `POST` リクエストを処理します。

source: And in the worst case, at least you got your flamegraphs \o/.
ja_jp: 最悪の場合でも、少なくともフレームグラフは見られますからね \o/。

source: And inject the code below into the `CoffeeResource` endpoint:
ja_jp: そして、以下のコードを `CoffeeResource` のエンドポイントに注入します。 :

source: And it goes without saying, introduce features as fast as we can because Quarkus has enabled us to do that better!
ja_jp: そして、言うまでもなく、Quarkusのおかげでできる限り早く機能を導入することができるようになりました!

source: And it should return `Hello!`. So good so far, we can also see the metrics in `http://localhost:8080/q/metrics` where should see our `greeting_counter` counter:
ja_jp: そして、 `Hello!` を返すはずです。ここまではいいとして、 `http://localhost:8080/q/metrics` でメトリクスを見ることもできます。ここでは、 `greeting_counter` のカウンターを確認できます:

source: And last but not least, our user entity:
ja_jp: そして最後に、私たちのユーザー・エンティティーです:

source: And let's build the native executable again:
ja_jp: そして、もう一度ネイティブ実行可能ファイルをビルドしてみましょう:

source: And let's end the mandatory configuration by defining a document identifier.
ja_jp: 続いて、ドキュメント識別子を定義し、必須設定を終了します。

source: And let's try to build again:
ja_jp: そして、またビルドしてみましょう:

source: And many more...
ja_jp: その他多数...

source: And much more!
ja_jp: 他多数!

source: And much more...
ja_jp: 他多数...

source: And must be used in a form of `{item_hasNext}` inside a `{#for}` section with the `item` element alias.
ja_jp: また、`{#for}` セクションの中で `{item_hasNext}` の形式で、`item` 要素のエイリアスと使用する必要があります。

source: And now press `Save`:
ja_jp: そして、 `Save` を押します。

source: And now set the configuration and write the test code the same way as it is described in the <<integration-testing-wiremock, Wiremock>> section above. The only difference is the name of `QuarkusTestResource`:
ja_jp: そして、設定を行い、上記の <<integration-testing-wiremock, Wiremock>> セクションで説明されているのと同じようにテストコードを記述します。唯一の違いkは `QuarkusTestResource` という名前です。

source: And now set the configuration and write the test code the same way as it is described in the xref:integration-testing-wiremock[Wiremock] section. The only difference is the name of `QuarkusTestResource`:
ja_jp: そして、 xref:integration-testing-wiremock[Wiremock] のセクションで説明したのと同じように設定を行い、テストコードを記述します。唯一違うのは、 `QuarkusTestResource` の名前です:

source: And now when you want to use your entity or its repository, besides using `@WithTransaction` in place of `@Transactional`, you have to compose operations as you normally do in reactive code with Mutiny, but the operations are exactly the same otherwise:
ja_jp: そして、エンティティーまたはそのリポジトリーを使用したい場合、`@Transactional` の代わりに `@WithTransaction` を使用する以外は、Mutiny を使用するリアクティブコードで通常行うように操作を構成する必要がありますが、それ以外は操作はまったく同じです。

source: And our extension also consumes this parser:
ja_jp: そして、私たちのエクステンションはこのパーサーも使用します。

source: And our user entity:
ja_jp: ユーザーエンティティーは次のようになります。

source: And probably many other things.
ja_jp: そして、おそらく他にも多くのものがあります。

source: And registration in:
ja_jp: そして以下に登録します。

source: And run it in JVM mode with:
ja_jp: その後、次のコマンドを使用して JVM モードで実行します。

source: And run it:
ja_jp: そして実行します:

source: And search for fruits by name or color via the flowing curl command:
ja_jp: また、以下の curl コマンドで、名前や色でフルーツを検索することができます:

source: And search for fruits by name or color via the following curl command:
ja_jp: また、以下のcurlコマンドで、名前や色でフルーツを検索することができます:

source: And should look like
ja_jp: そして、次のようになるはずです。

source: And since everything is AOT-compiled, there is no JIT compiler to optimize code at runtime, which can lead to suboptimal peak performance in some cases.
ja_jp: そして、すべてが AOT コンパイルされるため、実行時にコードを最適化する JIT コンパイラが存在せず、場合によっては最適なピークパフォーマンスが得られないことがあります。

source: And start it with:
ja_jp: 次のように起動します:

source: And suddenly, you're in brand-new territory: the Quarkus REST application you get from a simple `quarkus create app` starts in 130 milliseconds.
ja_jp: すると突然、未知の領域に足を踏み入れることになります。シンプルな `quarkus create app` で作成した Quarkus REST アプリケーションが 130 ミリ秒で起動するのです。

source: And thanks to our field access rewrite, when your users read `person.name` they will actually call your `getName()` accessor, and similarly for field writes and the setter. This allows for proper encapsulation at runtime as all fields calls will be replaced by the corresponding getter/setter calls.
ja_jp: また、当社のフィールドアクセスリライトのおかげで、ユーザーが `person.name` を読むときには、実際に `getName()` アクセサが呼び出されます。これはフィールドの書き込みやセッターについても同様です。これにより、すべてのフィールドの呼び出しが、対応するゲッター/セッターの呼び出しに置き換えられるため、実行時に適切なカプセル化が可能になります。

source: And that's enough!
ja_jp: これだけで十分です！

source: And that's it!
ja_jp: 以上です!

source: And that's it, now you can start creating instances of your entity, persist it to your database, after which point all changes to its fields will be automatically sent to the database (no need for any explicit `update` instruction), and even remove it from the database:
ja_jp: これで完了です。エンティティのインスタンス作成、データベースへの永続化を開始できます。その後は、フィールドへのすべての変更が自動的にデータベースに送信され (明示的な `update` 命令は不要)、データベースから削除することもできます。

source: And that's it: REST endpoint to validate Loan Applications will be automatically generated from this Rule Unit.
ja_jp: これで完了です。ローン申請を検証するためのRESTエンドポイントが、このRule Unitから自動的に生成されます。

source: And that’s all, folks!
ja_jp: 以上です!

source: And the Decision Requirement Graph (DRG) should look like:
ja_jp: そして、Decision Requirement Graph (DRG) は次のようになります:

source: And the `RequestUUIDHeaderFactory` would look like:
ja_jp: そして、 `RequestUUIDHeaderFactory` は次のようになります。

source: And the command will become:
ja_jp: また、コマンドは次のようになります:

source: And the endpoint to get all fruits from the backend:
ja_jp: そして、バックエンドからすべての fruits を取得するためのエンドポイント:

source: And the following properties will be passed in:
ja_jp: 次に、以下のプロパティが渡されます。

source: And the list keeps going...
ja_jp: そして、そのリストはまだまだ続きます...

source: And the output will be:
ja_jp: 出力は、以下のようになります。

source: And the service as follows:
ja_jp: そして、次のようなサービス:

source: And then add the following property to your `application.properties`:
ja_jp: 次に、`application.properties` に以下のプロパティーを追加します。

source: And then create a build step that uses this recorder:
ja_jp: そして、このレコーダーを使用するビルドステップを作成します。

source: And then explicitly list LGTM Dev Resource in the test as a `@QuarkusTestResource` resource:
ja_jp: そして、テスト内の LGTM Dev Resource を `@QuarkusTestResource` リソースとして明示的にリストします。

source: And then expose this POJO via a Resource like so:
ja_jp: そして、次のようなリソースを介してこの POJO を公開します。

source: And then in a template you can simply use `{cdi:userData.info}` or `{cdi:userData.username}`.
ja_jp: そしてテンプレートでは `{cdi:userData.info}` または `{cdi:userData.username}` です。

source: And then request a native build passing in the configuration apply flag. A message during the native build process will indicate that the native image agent generated configuration files are being applied:
ja_jp: 次に、設定適用フラグを渡してネイティブビルドを要求します。 ネイティブビルドプロセス中に、ネイティブイメージエージェントによって生成された設定ファイルが適用されていることを示すメッセージが表示されます。

source: And then the magic begins. When we added annotations to our entities, we made them available for full text search; we can now query the index using the Hibernate Search DSL, simply by adding the following method (and a few ``import``s):
ja_jp: そして魔法が始まります。 エンティティーにアノテーションを追加すると、全文検索が利用できるようになります。 以下のメソッド (およびいくつかの ``import``) を追加するだけで、Hibernate Search DSL を使用してインデックスをクエリーできるようになります。

source: And then the repository can be used as any other bean:
ja_jp: そして、リポジトリーは他の Bean と同様に使用できます。

source: And then things started to link:https://github.com/quarkusio/quarkus/pull/14179[go] link:https://github.com/quarkusio/quarkus/issues/15030[sideways]. Some cloud hosting providers only accept `200` as a definition of health, for example, so the redirect (a `301`) didn't have the intended effect. There was also some confusion about how to turn the non-application endpoint off to return to previous behavior, and further questions about how to move specific endpoints out of this non-application endpoint collection.
ja_jp: そして、事態は link:https://github.com/quarkusio/quarkus/issues/15030[悪化] link:https://github.com/quarkusio/quarkus/pull/14179[し]始めました。クラウドホスティングプロバイダの中には、例えば、ヘルスの定義として `200` のみを受け入れるものがあり、リダイレクト ( `301`) は意図した効果を発揮しませんでした。また、アプリケーション以外のエンドポイントをオフにして以前の動作に戻す方法についても混乱があり、特定のエンドポイントをこのアプリケーション以外のエンドポイントコレクションから移動させる方法についても疑問が残りました。

source: And then we can add the following methods (and a few ``import``s):
ja_jp: そして、次のようなメソッドを追加します（いくつかの `import` もあります）:

source: And then you can inject both types of repositories:
ja_jp: そして、両方のタイプのリポジトリを注入することができます。

source: And then you can write your entity as described before, extending a variant of `PanacheEntity` or not, as you wish.
ja_jp: その後、前に説明したように、`PanacheEntity` のバリアントを拡張するかどうかにかかわらず、必要に応じてエンティティを記述できます。

source: And then you can write your entity as usual, but for repositories you extend `CrudRepository` (or nothing if you wish to implement all the methods yourself), using the entity and its ID types as type parameters, and you must annotate the repository with `@Repository`.
ja_jp: その後、通常どおりにエンティティーを記述できますが、リポジトリーについては、エンティティーとその ID 型を型パラメーターとして使用して `CrudRepository` を拡張し (すべてのメソッドを自分で実装する場合は何も拡張しなくても構いません)、リポジトリーに `@Repository` アノテーションを付与する必要があります。

source: And there's more to it.
ja_jp: そして、それだけではありません。

source: And this config map resource will be integrated into the generated `kubernetes.json`/`kubernetes.yml`, and `openshift.json`/`openshift.yml` files.
ja_jp: そして、この config map リソースは、生成された `kubernetes.json`/`kubernetes.yml` ファイルおよび `openshift.json`/`openshift.yml` ファイルに統合されます。

source: And this is where the perspective shifts significantly: when you start in ~ 100 milliseconds, every dozen milliseconds you save becomes a meaningful improvement. You can no longer afford to ignore a 5-millisecond cost.
ja_jp: ここで視点が大きく変わります。約 100 ミリ秒で起動する場合、節約する十数ミリ秒のすべてが意味のある改善になります。もはや 5 ミリ秒のコストを無視することはできません。

source: And this method will be exposed along with the generated methods using `http://localhost:8080/people/name/Johan`.
ja_jp: そして、このメソッドは、生成されたメソッドとともに、 `http://localhost:8080/people/name/Johan` で公開されます。

source: And this release wouldn't be so great without all the people who tested our Betas and CR so a big thanks to everyone who participated in testing this release!
ja_jp: そして、このリリースはBetaとCRをテストしてくれた全ての人がいなければ、ここまで素晴らしいものにはならなかったでしょう。このリリースのテストに参加したすべての人に感謝します!

source: And this repository:
ja_jp: そしてこのリポジトリ:

source: And this resource:
ja_jp: およびこのリソースの場合:

source: And to be honest, this isn't just about improving startup performance, it's also about reducing the resources wasted during startup. We often talk about Green IT; let's make our libraries and frameworks greener, especially in cases where it's simple to achieve.
ja_jp: 正直なところ、これは単に起動パフォーマンスを向上させるだけでなく、起動時に浪費されるリソースを削減することでもあります。私たちはよく Green IT について話しますが、特に簡単に達成できるケースでは、ライブラリーやフレームワークをよりグリーンなものにしていきましょう。

source: And to handle the HTTP `DELETE` method in the web resource:
ja_jp: また、Web リソースで HTTP の `DELETE` メソッドを処理するには:

source: And update the `GreetingResource` and its test `GreetingResourceTest`:
ja_jp: そして、 `GreetingResource` とそのテスト `GreetingResourceTest` を更新します。

source: And update the configuration for the Quarkus front-end application, `GreetingResource`, which has been created earlier, to request that an authorization code flow access token (as opposed to ID token) includes an `aud` (audience) claim targeting `ApiEchoService`, as well as configure the base URL for the `ApiEchoService` REST client:
ja_jp: さらに、前に作成した Quarkus フロントエンドアプリケーション `GreetingResource` の設定を更新して、認可コードフローの (ID トークンではなく) アクセストークンに `ApiEchoService` をターゲットとする `aud` (オーディエンス) クレームを組み込むようにリクエストし、 `ApiEchoService` REST クライアントのベース URL を設定します。

source: And vice versa - the extension bean can inject application beans and beans provided by other extensions:
ja_jp: また、その逆に、 エクステンション Bean は、他のエクステンションによって提供されるアプリケーション Bean やアプリケーション Bean を注入することができます。

source: And we can configure the generated RoleBinding resource by selecting the role to be used and the subject.
ja_jp: そして、生成されたRoleBindingリソースは、使用するロールとサブジェクトを選択することで設定することができます。

source: And we end up with:
ja_jp: そして以下のようになります:

source: And we had more questions, too. Was there a performance difference between Spring Boot 3 and Spring Boot 4? It turns out things got better in some ways, and worse in others. Spring 4 gives higher throughput than Spring 3, but at the expense of a slower time to first response, and a higher memory footprint.
ja_jp: そして、他にも疑問がありました。Spring Boot 3とSpring Boot 4の間でパフォーマンスに違いはあったのでしょうか？いくつかの点で改善され、いくつかの点で悪化したことが判明しました。Spring 4はSpring 3よりも高いスループットを提供しますが、最初の応答までの時間が遅くなり、メモリフットプリントも増加するという犠牲を伴います。

source: And we obtain the following result:
ja_jp: そして、次のような結果が得られます:

source: And we want to use it to receive messages from Kafka, make some price transformation, and send messages back to Kafka.
ja_jp: そして、Kafka からメッセージを受信して、何らかの価格変換を行い、Kafka にメッセージを送り返すために使いたいと考えています。

source: And we will produce a `GitHubApiClassWithBridgeMethodsBuildItem` for each class:
ja_jp: そして、各クラスごとに `GitHubApiClassWithBridgeMethodsBuildItem` を作成します。

source: And we would get the following response:
ja_jp: そして、次のようなレスポンスが返ってきます:

source: And we would register this filter to the console handler like so:
ja_jp: そして、このフィルタをコンソールハンドラにこのように登録します:

source: And we'd like to render a simple HTML page that contains the item name and price.
ja_jp: そして、商品名と価格が記載されたシンプルな HTML ページをレンダリングしたいと思います。

source: And we'll add the Greeting resource:
ja_jp: そして、Greetingリソースを追加します。

source: And we're not going to stop here, so stay tuned for more performance improvements and exciting new features in the coming weeks. We're actually planning to make it easier for you to get those new bits as soon as possible, by publishing updates to the EAP release channel.
ja_jp: そして、我々はここで止まるつもりはないので、今後数週間のうちにさらなるパフォーマンス向上とエキサイティングな新機能にご期待ください。実は、EAPリリース・チャンネルにアップデートを公開することで、できるだけ早くこれらの新しいビットを入手しやすくする予定です。

source: And what's also interesting is that there's an additional cost for transforming the time zone to a `ZoneId`, as you also have to load the zone rules.
ja_jp: さらに興味深いのは、タイムゾーンを `ZoneId` に変換する際にも、ゾーンルールをロードする必要があるため、追加のコストがかかることです。

source: And yeah, we still have cool concert shirts and swag.
ja_jp: また、クールなコンサートシャツやスワッグも用意しています。

source: And you can be sure that some resources will be loaded from your classpath:
ja_jp: そして、いくつかのリソースがクラスパスからロードされることは間違いありません。

source: And you pass the marshaller by defining the following:
ja_jp: そして、以下のように定義してマーシャラを渡します:

source: And you will see the following message:
ja_jp: 以下のメッセージが表示されます。

source: And you're all set!
ja_jp: これで準備完了です!

source: And, finally, run it with:
ja_jp: 最後に、以下を実行します:

source: And, in a separate terminal:
ja_jp: そして、別の端末で以下を実行します。

source: And, in another terminal, run:
ja_jp: そして、別の端末で、次を実行します。

source: And, next, build the application with:
ja_jp: そして次に、アプリケーションをビルドします:

source: Annotate a `final` class that implements `java.util.logging.Filter` with `@io.quarkus.logging.LoggingFilter`, and set the `name` property:
ja_jp: `java.util.logging.Filter` を実装する `final` クラスを `@io.quarkus.logging.LoggingFilter` でアノテートし、 `name` プロパティを設定します:

source: Annotate a class with `@io.quarkus.qute.CheckedTemplate` and all its `static native` methods will be used to define type-safe templates and the list of parameters they require.
ja_jp: クラスにアノテーション `@io.quarkus.qute.CheckedTemplate` を付けると、そのすべての `static native` メソッドが、タイプセーフなテンプレートと、それに必要なパラメーターリストを定義するために使用されます。

source: Annotate it with link:{jakarta-persistence-javadocs-url}/jakarta/persistence/entity[`@Entity`]
ja_jp: link:{jakarta-persistence-javadocs-url}/jakarta/persistence/entity[`@Entity`] でアノテーションを付けます。

source: Annotate method with `@OpenApiFilter` and the run stage (BUILD,RUN,BOTH)
ja_jp: メソッドに `@OpenApiFilter` と実行ステージ (BUILD、RUN、BOTH) でアノテーションを付けます。

source: Annotate the TenantResolver implementation with the `@PersistenceUnitExtension` qualifier to tell Quarkus it should be used in the default persistence unit.
ja_jp: TenantResolverの実装に `@PersistenceUnitExtension` という修飾語を付けて、Quarkusにデフォルトの永続化ユニットで使用することを伝えます。

source: Annotate the bean with `@io.quarkus.runtime.Startup` as described in xref:lifecycle.adoc#startup_annotation[Startup annotation]:
ja_jp: xref:lifecycle.adoc#startup_annotation[Startup annotation]: で説明したように、 `@io.quarkus.runtime.Startup` で Bean をアノテーションします。

source: Annotate the class with `@OpenApiFilter` and use the `stages` field with one or more of `BUILD`, `RUNTIME_STARTUP`, or `RUNTIME_PER_REQUEST`. This filter runs once during build, and once every time the OpenAPI document is requested.
ja_jp: クラスに `@OpenApiFilter` アノテーションを付与し、`stages` フィールドで `BUILD`、`RUNTIME_STARTUP`、`RUNTIME_PER_REQUEST` のいずれか 1 つ以上を指定します。このフィルターはビルド時に 1 回、および OpenAPI ドキュメントが要求されるたびに実行されます。

source: Annotate the configurer implementation with the `@SearchExtension` qualifier to tell Quarkus it should be used by Hibernate Search Standalone.
ja_jp: Configurer の実装に `@SearchExtension` 修飾子のアノテーションを付けて、 Hibernate Search Standalone で使用するように Quarkus に指示します。

source: Annotate the configurer implementation with the `@SearchExtension` qualifier to tell Quarkus it should be used by Hibernate Search in the default persistence unit.
ja_jp: Configurer の実装に `@SearchExtension` 修飾子のアノテーションを付け、 デフォルトの永続ユニットで Hibernate Search Standalone によって使用されるように Quarkus に指示します。

source: Annotate the configurer implementation with the `@SearchExtension` qualifier to tell Quarkus it should be used in Hibernate Search Standalone, for all Elasticsearch indexes (by default).
ja_jp: Configurer の実装に `@SearchExtension` 修飾子のアノテーションを付けて、 すべての Elasticsearch インデックスに対して (デフォルトで) Hibernate Search Standalone で使用するように Quarkus に指示します。

source: Annotate the configurer implementation with the `@SearchExtension` qualifier to tell Quarkus it should be used in the default persistence unit, for all Elasticsearch indexes (by default).
ja_jp: Configurerの実装に `@SearchExtension` アノテーションを付けて、QuarkusにすべてのElasticsearchインデックスに(デフォルトで)デフォルトの永続化ユニットを使用するように指示します。

source: Annotate the format mapper implementation with the `@JsonFormat` qualifier to tell Quarkus that this mapper is specific to JSON serialization/deserialization.
ja_jp: フォーマットマッパーの実装に `@JsonFormat` 修飾子のアノテーションを付与し、 このマッパーが JSON のシリアル化/デシリアル化固有であることを Quarkus に知らせます。

source: Annotate the format mapper implementation with the `@PersistenceUnitExtension` qualifier to tell Quarkus it should be used in the default persistence unit.
ja_jp: フォーマットマッパーの実装に `@PersistenceUnitExtension` 修飾子のアノテーションを付与し、 これがデフォルトの永続化ユニットで使用されるべきものであることを Quarkus に知らせます。

source: Annotate the format mapper implementation with the `@XmlFormat` qualifier to tell Quarkus that this mapper is specific to XML serialization/deserialization.
ja_jp: このマッパーが XML のシリアライズ/デシリアライズ専用であることを Quarkus に知らせるために、フォーマットマッパーの実装に `@XmlFormat` 修飾子のアノテーションを付与します。

source: Annotate the interceptor implementation with the `@PersistenceUnitExtension` qualifier to tell Quarkus it should be used in the default persistence unit.
ja_jp: インターセプターの実装に `@PersistenceUnitExtension` の修飾子を付けて、Quarkusにデフォルトの永続化ユニットで使用されるように伝えます。

source: Annotate the model class with <<template_data,`@TemplateData`>> - a specialized value resolver is generated and used at runtime
ja_jp: モデルクラスに <<template_data,`@TemplateData`>> のアノテーションを付ける - 実行時に専用の値リゾルバーが生成され、使用されます。

source: Annotate the model class with `@io.quarkus.runtime.annotations.RegisterForReflection` to make the reflection-based value resolver work
ja_jp: モデルクラスに `@io.quarkus.runtime.annotations.RegisterForReflection` のアノテーションを付けて、リフレクションベースの値リゾルバーを動作させます。

source: Annotate the model class with `@io.quarkus.runtime.annotations.RegisterForReflection` to make the reflection-based value resolver work. More details about the `@RegisterForReflection` annotation can be found on the xref:writing-native-applications-tips.adoc#registerForReflection[native application tips] page.
ja_jp: リフレクションベースの値リゾルバーが機能するためには、モデルクラスにアノテーション `@io.quarkus.runtime.annotations.RegisterForReflection` が必要です。`@RegisterForReflection` アノテーションの詳細は、xref:writing-native-applications-tips.adoc#registerForReflection[ネイティブアプリケーションのヒント] ページを参照してください。
